In [1]:
import pandas as pd
employees = pd.read_csv("employee.csv")
employees

   id   name  salary  departmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Tim   90000             1

In [2]:
departments = pd.read_csv("department.csv")
departments

   id   name
0   1     IT
1   2  Sales

## Solution #1

In [3]:
highest_salary = employees.groupby("departmentId")["salary"].agg("max")
highest_salary_df = employees[employees["salary"].isin(highest_salary)]
highest_salary_df

   id   name  salary  departmentId
1   2    Jim   90000             1
2   3  Henry   80000             2
4   5    Tim   90000             1

In [4]:
merged_df = highest_salary_df.merge(departments, left_on="departmentId", right_on="id")
merged_df

   id_x name_x  salary  departmentId  id_y name_y
0     2    Jim   90000             1     1     IT
1     3  Henry   80000             2     2  Sales
2     5    Tim   90000             1     1     IT

In [5]:
result_df = merged_df[["name_y", "name_x", "salary"]]
result_df.columns = ["Department", "Employee", "Salary"]
result_df

  Department Employee  Salary
0         IT      Jim   90000
1      Sales    Henry   80000
2         IT      Tim   90000

## Solution #2

In [6]:
mask = employees.groupby("departmentId")["salary"].transform(lambda x: x == x.max())
high_salary = employees[mask]
high_salary

   id   name  salary  departmentId
1   2    Jim   90000             1
2   3  Henry   80000             2
4   5    Tim   90000             1

In [7]:
merged_df = pd.merge(high_salary, departments, left_on="departmentId", right_on="id")
merged_df

   id_x name_x  salary  departmentId  id_y name_y
0     2    Jim   90000             1     1     IT
1     3  Henry   80000             2     2  Sales
2     5    Tim   90000             1     1     IT

In [8]:
merged_df.rename(
    columns={"name_x": "Employee", "salary": "Salary", "name_y": "Department"},
    inplace=True,
)
merged_df[["Department", "Employee", "Salary"]]

  Department Employee  Salary
0         IT      Jim   90000
1      Sales    Henry   80000
2         IT      Tim   90000